[
  {
    "path": "posts/the_money_promise/",
    "title": "The Money Promise",
    "description": "Let's see what money is all about, how we measure it, and what to expect from it.",
    "author": [
      {
        "name": "David Heilbron",
        "url": "https://davidheilbron.com"
      }
    ],
    "date": "2025-08-17",
    "categories": [],
    "contents": "\nDisclaimer: I’m a heavy AI user. I use it to check references, improve text, debug code and search for databases. I intend this blog to be leveraged on AI capabilities and to offer features to its readers that were not possible before. I’m embracing the technology as much as possible and will continue to do so.\nPlease criticize me, I’m here to learn and open to constructive discussions.\nThis post will open a discussion on money, its value, how it’s measured, and how does it move around the world. I expect to generate more doubts and questions than the ones I’m attempting to answer, and to provide you, my reader, with some ground to stand and move onto more advanced topics. Today I’ll provide examples using data from the European Central Bank, publicly available free of cost for everyone.\nMoney in our lives\nWhat is money doing in our lives and why do we actually use it? Well, it is kind of straightforward, isn’t it? We could instead trade with goods directly (barter economy) (Friedman and Schwartz 1963) , say salt, cigarettes, silver; but that’s quite difficult to standardize, physically move, and sometimes, store. Therefore, as Meltzer and Friedman wrote, money is the medium in which prices and values are expressed; as currency, it circulates anonymously from person to person and country to country, thus facilitating trade, and it is the principal measure of wealth. As they put it simply: money’s function is to enable buying to be separated from selling. If we were trading goods, we’d sooner than later arrive at the so-called double coincidence of barter.\nClear, but where does it get its value from? who or what guarantees that 10 euros are 10 euros? The short answer is that money has value because society accepts it in exchange for goods, services, and the settlement of debts. But the full picture is more nuanced. We all agree, implicitly - nobody asked us if we actually believe in this or not (Graeber 2011) - that a euro, dollar, yuan, or peso, has value equivalent to its nominal amount, which we can exchange for another good or service, or we can just accumulate in reserves.\nIn economics, we often describe money as the numéraire good (Mas-Colell, Whinston, and Green 1995) . This means it serves as the unit in which all other prices are quoted. Importantly, this is a matter of convention, not intrinsic value: we could just as well measure everything in bananas, ounces of gold, or barrels of oil. Setting money as the numéraire is simply a convenient normalization that allows us to express the relative values of all goods and services.\nHow is money measured\nMoney can be classified in different categories, it can be physical or digital, it can represent different levels of liquidity, and more. To simplify things, I’ll mention under the physical realm there’s fiat money, which doesn’t have intrinsic value (US dollars, rubles, yens), paper certificates which are convertible into goods (e.g. for gold or silver); under the digital realm there are digital currencies (e.g., Bitcoin, game currencies); and there are different levels of liquidity, or formally called Monetary Aggregates, and they are measured by Central Banks and a key reference for monetary policy. I will take a small detour just to show some real-world data on this.\nMonetary Aggregates are mostly three, and they are based on liquidity levels (how easy they can be spent). I must say also that not all Central Banks measure their money supply exactly the same way, there are usually some discrepancies. Let’s take the European Central Bank (ECB) and its definitions:\nM1 (narrow money): is the most liquid measure of money, comprising currency (banknotes and coins) in circulation and overnight deposits.\nM2: M1 + deposits with an agreed maturity of up to two years and deposits redeemable at notice of up to three months.\nM3: M2 + repurchase agreements, money market fund shares/units, and debt securities with a maturity of up to two years issued by MFI (Monetary Financial Institutions).\n\n\n\nThe graph above is telling us the value of the money supply from the European Central Bank, i.e. the value of all the euros equivalent forms of money. For example, in June 2025 the M1 registered a value of EUR 10,805 thousand millions, meaning that’s the value of cash and immediate available deposits in the Euro Area economy. This is the amount of money that is readily available for spending and payments. We can have another look at how much it is increasing, year-over-year.\n\n\n\nWe could interpret the graph above in the following way. In June 2025, M1 in the euro area grew by 4.6% compared with June 2024, faster than M2 (2.8%) and M3 (3.3%). At first glance, one might think this reflects an “injection of money” by the European Central Bank, followed by banks lending more to customers.\nIn reality, the story is more complex. With the information available at this point, we can only guess about the causes of the increase; on one hand, it can be a reaction on monetary policy changes or changes on the private sector’s liquidity preferences. A real interpretation would require a broader macroeconomic and policy context.\nThe Role of the Central Banks\nWho guarantees the currency value? That’s the central banks role, sometimes. In reality in depends on the Central Bank’s objective, which differs widely across geographies. Each currency is issued by an institution, that’s almost always a Central Bank, and it can issue tender for a region, country or a group of countries, e.g., the Hong Kong Monetary Authority backs up the Hong Kong dollar, the European Central Bank issues the Euro.\nThus, a given government doesn’t necessarily control the monetary policy on its territory, e.g. Ecuador, Panama, Timor-Leste, Marshall Islands, British Virgin Islands, and many others use the US Dollar as standard currency, hence have no control over their monetary policy, which is dictated by the Federal Reserve System (FED) in Washington D.C.. And, as you might be aware, the US dollar is the reserve currency in the world since the end of World War Two.\nEvery Central Bank has a different mandate given by the Constitution of the country or union it belongs to, hence, not all Central Banks work the same way, but it’s safe to assume, in broad terms, that its goal is to maintain the stability of their currency, either in terms of domestic purchasing power or exchange rate stability. Some Central Banks have mandates on employment or on financial stability, and this is what shapes their tools and the nature of their interventions. The Central Bank then needs to build trust in society, so their mandates can be achieved, to put it simply, it needs to be seen as a responsible institution which is able to pay its debts and manage the money supply responsibly.\nThe crucial element is that people actually need to trust the Central Banks, because if not, economies get into big troubles and wealth is destroyed, literally. Some examples of this are the Weimar Republic Hyperinflation (1921 - 1923), the Mexican Peso crisis (1994 - 1995), Asian Financial Crisis (1997 - 1998) and the Argentinian Currency Crisis of the early 2000s (Graham 1930) .\nJust as currencies rely on people’s confidence that others will accept them, banks depend on trust to function. When you deposit money, you expect it to be available at any time, even though the bank has already lent most of it out or invested it elsewhere. This system of maturity transformation, i.e. borrowing short-term from depositors while lending long-term to households, firms, or governments, works smoothly in normal times and is central to how banks create value. Yet it also introduces fragility: if too many people demand their deposits back at once, the bank may be unable to liquidate its long-term assets quickly without incurring heavy losses.\nThis fragility is what makes bank runs possible (Diamond and Dybvig 1983) . Even a solvent bank can collapse if confidence evaporates and depositors rush to withdraw simultaneously. Because fear can spread rapidly, such runs often jump from one institution to others, turning isolated concerns into a systemic crisis.\nDeposit insurance, central bank emergency lending, and tighter regulation all exist to contain this risk, but they do not eliminate the fundamental reliance on trust. In both money and banking, stability rests not only on balance sheets but also on the shared belief that others will continue to trust the system tomorrow.\nThe system is intrinsically based on trust and needs people to trust that the banks will have the cash when they need it or that the banks will pay the promised interest on deposits. On the other hand, the banks need to trust the Central Bank that their reserves are also safeguarded, as well as to trust its debtors that the debts will be paid. This can be seen also from the perspective of information gathering, and asymmetries of information, which is a fascinating topic in economics as well.\nPart of the plethora of economic information available nowadays in western countries are expectation surveys, which decision makers incorporate into their analysis when guiding economic policy (Muth 1961) . I’m getting ahead of myself here, but to illustrate this, below is one of the many monthly surveys conducted by the ECB.\nWe will take a look at the Consumer Expectations Survey, which is a mixed frequency modular survey, conducted online. More methodological details are available here\n\n\n\nThe graph above tells us the percentage of the surveyed people that think the price of houses will increase in the next 12 months, the percentage that think the prices will decrease and the difference between both. The role of expectations in the economy is a topic that has been widely studied for around 200 years, and modern economic measurements incorporate them into their statistics, as well as policy makers when evaluating results or need to make decisions.\nThe toolbox of a Central Bank\nWe just saw an example of expectation measurement from the ECB, that’s actually part of their toolbox. Qualitative and quantitative information from the market helps set the direction of the policies in place. Let’s dig further with the following two questions:\nHow do Central Banks execute their mandate?\nWhy do Central Banks need to intervene?\nLet’s start with the second question, for which the Quantity Theory of Money would answer that currencies can’t keep its value constant because money is a good itself, subject to the laws of supply and demand (Fisher 1911). If there’s not enough money following the transactions (demand higher than offer) its value will increase, and vice-versa.\nAs with any good, currency demand is dynamic, requiring constant monitoring from Central Banks to allow for control of its supply and create conditions for equilibrium. This framework is not the only plausible explanation for the currency’s value loss, other factors come into play such as expectations and supply and demand shocks. This translates itself on the need of the institutions to intervene and bring stability into the market, as the unpredictability and volatility of this economics aggregates is quite obvious.\nA key measurement Central Bank follows is inflation, which is an estimation of the price increase of certain goods in a specific period of time. There’s monetary inflation and consumer price inflation, which differ on the underlying causes for the price increase. To exemplify this, here we can see the trend of the consumer price inflation (CPI) in the Euro area from 1997 until July 2025.\n\n\n\nTo answer the first question, Central Banks have several tools to intervene the money supply, to increase or decrease it. The primary tool is the set of key policy interest rates, among which the Main Refinancing Operations (MRO) rate is central (Mishkin 2007) . This rate is the overnight lending rate at which commercial banks borrow funds from the central bank, thereby influencing short-term interest rates and liquidity conditions in the banking system.\nBesides the MRO rate, the central bank also sets the Deposit Facility rate and the Marginal Lending Facility rate, which establish the corridor for overnight market rates. These key rates collectively steer borrowing costs and incentives for saving or spending.\nAdditionally, central banks conduct open market operations (OMO), i.e. buying or selling securities—to manage money supply and short-term interest rates. They also impose reserve requirements on banks, which set the minimum reserves banks must hold, directly impacting their lending capacity.\nIn recent years, non-traditional tools like quantitative easing (QE)—large-scale asset purchases—have complemented conventional instruments by injecting liquidity and lowering longer-term interest rates. Forward guidance is used to communicate the expected future path of interest rates and monetary policy, shaping market and public expectations.\nWhen inflation accelerates beyond the target, central banks typically raise these key interest rates to increase the cost of borrowing, encouraging saving over consumption (Taylor 1993) . This mechanism works by altering intertemporal preferences: individuals and firms weigh present versus future consumption differently, mediated by interest rate changes and expectations about inflation.\nThus, central banks use a comprehensive toolkit, anchored fundamentally by short-term policy interest rates, to fulfill their mandate of price stability and economic growth.\n\n\n\nThe bottom line of this short review of economic concepts laid on this entry is to realize the size of the tip of the iceberg. Undoubtedly complex our monetary system is, and there’s some very serious people making decisions and study the signals provided by our behavior as a society. It is no joke what is going on with Bitcoin, altcoins, and crypto-currencies in general. As the system is quite enormous and intricate, getting a clear answer over any real issue is not feasible by design. The short answer is almost always a reserved ‘it depends’, which follows by a probably biased opinion on how the causes and solutions. The reason why? Because, as said by professor Calomiris, ‘[…] economics is politics, and there’s not one without the other.’\nMy take is the following: money is a promise, one that is taken very seriously by almost everyone in the world. The current system allows humanity to develop entire nations in decades time, or to sink generations into poorness and misery for centuries. Getting it right shouldn’t be optional, as everyone of us is able to honor our word we are also able to play this game, to make the right decisions every day in our sphere of influence. It is evident and certain that honorable behaviors are scalable and rewarded accordingly.\nIt will never stop to amaze me that no matter how many equations, regressions, and sampling we do, many historic events boil down to the simple human psyche: our motivations, symbols, and the stories we are told. No matter how smart and sophisticated our methods are, we do not live on a deterministic world, and that’s more than enough hope to keep on going,\nFurther readings:\nTransmission Mechanisms of Monetary Policy\nFinancial Stability and Macroprudential Policy\nDigital Currencies and the Future of Money\n\n\n\nDiamond, Douglas W, and Philip H Dybvig. 1983. “Bank Runs, Deposit Insurance, and Liquidity.” Journal of Political Economy 91 (3): 401–19.\n\n\nFisher, Irving. 1911. The Purchasing Power of Money: Its Determination and Relation to Credit Interest and Crises. Macmillan.\n\n\nFriedman, Milton, and Anna Jacobson Schwartz. 1963. A Monetary History of the United States, 1867-1960. Princeton University Press.\n\n\nGraeber, David. 2011. Debt: The First 5,000 Years. Melville House.\n\n\nGraham, Frank Dunstone. 1930. Exchange, Prices, and Production in Hyper-Inflation: Germany, 1920-1923. Princeton University Press.\n\n\nMas-Colell, Andreu, Michael Dennis Whinston, and Jerry R Green. 1995. Microeconomic Theory. Oxford University Press.\n\n\nMishkin, Frederic S. 2007. The Economics of Money, Banking, and Financial Markets. Pearson/Addison Wesley.\n\n\nMuth, John F. 1961. “Rational Expectations and the Theory of Price Movements.” Econometrica: Journal of the Econometric Society, 315–35.\n\n\nTaylor, John B. 1993. “Discretion Versus Policy Rules in Practice.” Carnegie-Rochester Conference Series on Public Policy 39: 195–214.\n\n\n\n\n",
    "preview": "posts/the_money_promise/the_money_promise_files/figure-html5/monetary_aggregates-1.png",
    "last_modified": "2025-08-17T18:37:02+02:00",
    "input_file": "the_money_promise.knit.md",
    "preview_width": 1536,
    "preview_height": 960
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome!",
    "description": "Welcome to my new blog, Data Science & Economics. I hope you enjoy reading my content.",
    "author": [
      {
        "name": "David Heilbron",
        "url": "https://davidheilbron.com"
      }
    ],
    "date": "2025-08-05",
    "categories": [],
    "contents": "\nMy name is David, I’m an Economist from Icesi University in Cali, Colombia and a Data Scientist from the University of Milan. This blog is an attempt to bring out topics of my interest and domain and make them available to the public.\nThis is the first time I write a blog, so there’s a lot of learning going on right now. I don’t consider myself an expert in Economics or Data Science, but a day-to-day citizen willing to learn by doing and to give its two cents to the plethora of available knowledge in the internet.\nI will try my best to be original and give it my own twist, hopefully I can print (?) my values and skills into the blog, thus proposing discussions, stating my views, and hopefully, inspiring others.\nAs a personal side note, I consider people (myself included) nowadays got used to have a passive role in society, not expressing their thoughts, not committing to anything, not exposing themselves or taking risks, not having uncomfortable conversations. I can’t control the world, but I can definitely chose the path I want for my life, and writing is part of it.\nI’m from Cali, Colombia. Based in Munich, Germany.\n\n\n\n",
    "preview": {},
    "last_modified": "2025-08-09T20:45:36+02:00",
    "input_file": {}
  }
]
